## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # kubernetes_manifest.certificate_argo_argo will be created
+   resource "kubernetes_manifest" "certificate_argo_argo" {
+       manifest = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               name      = "argocd-cert"
+               namespace = "argocd"
            }
+           spec       = {
+               commonName = "argocd.wayofthesys.org"
+               dnsNames   = [
+                   "argocd.wayofthesys.org",
                ]
+               issuerRef  = {
+                   kind = "ClusterIssuer"
+                   name = "zerossl"
                }
+               secretName = "wayofthesys-org-tls"
            }
        }
+       object   = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd-cert"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               additionalOutputFormats = (known after apply)
+               commonName              = "argocd.wayofthesys.org"
+               dnsNames                = [
+                   "argocd.wayofthesys.org",
                ]
+               duration                = (known after apply)
+               emailAddresses          = (known after apply)
+               encodeUsagesInRequest   = (known after apply)
+               ipAddresses             = (known after apply)
+               isCA                    = (known after apply)
+               issuerRef               = {
+                   group = (known after apply)
+                   kind  = "ClusterIssuer"
+                   name  = "zerossl"
                }
+               keystores               = {
+                   jks    = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
+                   pkcs12 = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
                }
+               literalSubject          = (known after apply)
+               privateKey              = {
+                   algorithm      = (known after apply)
+                   encoding       = (known after apply)
+                   rotationPolicy = (known after apply)
+                   size           = (known after apply)
                }
+               renewBefore             = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               secretName              = "wayofthesys-org-tls"
+               secretTemplate          = {
+                   annotations = (known after apply)
+                   labels      = (known after apply)
                }
+               subject                 = {
+                   countries           = (known after apply)
+                   localities          = (known after apply)
+                   organizationalUnits = (known after apply)
+                   organizations       = (known after apply)
+                   postalCodes         = (known after apply)
+                   provinces           = (known after apply)
+                   serialNumber        = (known after apply)
+                   streetAddresses     = (known after apply)
                }
+               uris                    = (known after apply)
+               usages                  = (known after apply)
            }
        }
    }

  # kubernetes_manifest.certificate_argo_istio will be created
+   resource "kubernetes_manifest" "certificate_argo_istio" {
+       manifest = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               name      = "argocd-cert"
+               namespace = "istio-system"
            }
+           spec       = {
+               commonName = "argocd.wayofthesys.org"
+               dnsNames   = [
+                   "argocd.wayofthesys.org",
                ]
+               issuerRef  = {
+                   kind = "ClusterIssuer"
+                   name = "zerossl"
                }
+               secretName = "wayofthesys-org-tls"
            }
        }
+       object   = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd-cert"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               additionalOutputFormats = (known after apply)
+               commonName              = "argocd.wayofthesys.org"
+               dnsNames                = [
+                   "argocd.wayofthesys.org",
                ]
+               duration                = (known after apply)
+               emailAddresses          = (known after apply)
+               encodeUsagesInRequest   = (known after apply)
+               ipAddresses             = (known after apply)
+               isCA                    = (known after apply)
+               issuerRef               = {
+                   group = (known after apply)
+                   kind  = "ClusterIssuer"
+                   name  = "zerossl"
                }
+               keystores               = {
+                   jks    = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
+                   pkcs12 = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
                }
+               literalSubject          = (known after apply)
+               privateKey              = {
+                   algorithm      = (known after apply)
+                   encoding       = (known after apply)
+                   rotationPolicy = (known after apply)
+                   size           = (known after apply)
                }
+               renewBefore             = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               secretName              = "wayofthesys-org-tls"
+               secretTemplate          = {
+                   annotations = (known after apply)
+                   labels      = (known after apply)
                }
+               subject                 = {
+                   countries           = (known after apply)
+                   localities          = (known after apply)
+                   organizationalUnits = (known after apply)
+                   organizations       = (known after apply)
+                   postalCodes         = (known after apply)
+                   provinces           = (known after apply)
+                   serialNumber        = (known after apply)
+                   streetAddresses     = (known after apply)
                }
+               uris                    = (known after apply)
+               usages                  = (known after apply)
            }
        }
    }

  # kubernetes_manifest.certificate_resource will be destroyed
  # (because kubernetes_manifest.certificate_resource is not in configuration)
-   resource "kubernetes_manifest" "certificate_resource" {
-       manifest = {
-           apiVersion = "cert-manager.io/v1"
-           kind       = "Certificate"
-           metadata   = {
-               name      = "argocd-cert"
-               namespace = "istio-system"
            }
-           spec       = {
-               commonName = "argocd.wayofthesys.org"
-               dnsNames   = [
-                   "argocd.wayofthesys.org",
                ]
-               issuerRef  = {
-                   kind = "ClusterIssuer"
-                   name = "zerossl"
                }
-               secretName = "wayofthesys-org-tls"
            }
        } -> null
-       object   = {
-           apiVersion = "cert-manager.io/v1"
-           kind       = "Certificate"
-           metadata   = {
-               annotations                = null
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = null
-               generateName               = null
-               generation                 = null
-               labels                     = null
-               managedFields              = null
-               name                       = "argocd-cert"
-               namespace                  = "istio-system"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           spec       = {
-               additionalOutputFormats = null
-               commonName              = "argocd.wayofthesys.org"
-               dnsNames                = [
-                   "argocd.wayofthesys.org",
                ]
-               duration                = null
-               emailAddresses          = null
-               encodeUsagesInRequest   = null
-               ipAddresses             = null
-               isCA                    = null
-               issuerRef               = {
-                   group = null
-                   kind  = "ClusterIssuer"
-                   name  = "zerossl"
                }
-               keystores               = {
-                   jks    = {
-                       create            = null
-                       passwordSecretRef = {
-                           key  = null
-                           name = null
                        }
                    }
-                   pkcs12 = {
-                       create            = null
-                       passwordSecretRef = {
-                           key  = null
-                           name = null
                        }
                    }
                }
-               literalSubject          = null
-               privateKey              = {
-                   algorithm      = null
-                   encoding       = null
-                   rotationPolicy = null
-                   size           = null
                }
-               renewBefore             = null
-               revisionHistoryLimit    = null
-               secretName              = "wayofthesys-org-tls"
-               secretTemplate          = {
-                   annotations = null
-                   labels      = null
                }
-               subject                 = {
-                   countries           = null
-                   localities          = null
-                   organizationalUnits = null
-                   organizations       = null
-                   postalCodes         = null
-                   provinces           = null
-                   serialNumber        = null
-                   streetAddresses     = null
                }
-               uris                    = null
-               usages                  = null
            }
        } -> null
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
